ramsza/info.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pl" xml:lang="pl">
<head>
<!-- 2022-04-06 Wed 14:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Praca licencjacka</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Michał Ramsza" />
<link rel="stylesheet" type="text/css" href="http://michal.ramsza.org/res/indexstyle_20170331.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Praca licencjacka</h1>

<div id="outline-container-orgd13f865" class="outline-2">
<h2 id="orgd13f865">Plan prac</h2>
<div class="outline-text-2" id="text-orgd13f865">
</div>
<div id="outline-container-org9373c2f" class="outline-3">
<h3 id="org9373c2f"><span class="done DONE">DONE</span> Stworzenie repo i odpowieniej struktur</h3>
</div>
<div id="outline-container-org3ce3ee7" class="outline-3">
<h3 id="org3ce3ee7"><span class="todo TODO">TODO</span> Przeczytanie dokładne artykułu</h3>
<div class="outline-text-3" id="text-org3ce3ee7">
<p>
Tutaj jeszcze trzeba dokładnie zrozumieć co autorzy mieli na myśli. 
</p>
</div>
</div>

<div id="outline-container-org800e0a7" class="outline-3">
<h3 id="org800e0a7"><span class="todo TODO">TODO</span> Stowrzenie algorytmu i struktury symulacji na podstawie artykułu</h3>
<div class="outline-text-3" id="text-org800e0a7">
<ol class="org-ol">
<li>Wybranie wartości parametrów (to jest dobierane tak jak w atrykule)</li>
<li>Początek glównej pętli symulacji (ile razy powtarzamy symulację)
<ul class="org-ul">
<li>Stworzenie grafu losowego BA</li>
<li>Wylosowanie warunków początkowych</li>
<li>Przeprowadzenie symulacji</li>
<li>Stworzenie ścieżki kooperacji \( c_t \), gdzie \( c_t \) to udział kooperacji w populacji</li>
</ul></li>
<li>Koniec pętli symulacji (powtórzenie symulacji)</li>
</ol>
</div>
</div>

<div id="outline-container-org7b5c2a8" class="outline-3">
<h3 id="org7b5c2a8"><span class="todo TODO">TODO</span> Przeprowadzenie symulacji</h3>
</div>
<div id="outline-container-org347a128" class="outline-3">
<h3 id="org347a128"><span class="todo TODO">TODO</span> Napisanie skryptu liczącego mierniki oraz wizualizacji</h3>
<div class="outline-text-3" id="text-org347a128">
<p>
Ten skrypt musi wyrzucać z siebie albo elementy LaTeXa albo wykresy w postaci png / pdf. 
</p>
</div>
</div>

<div id="outline-container-orgffa2701" class="outline-3">
<h3 id="orgffa2701"><span class="todo TODO">TODO</span> Napisanie pracy</h3>
<div class="outline-text-3" id="text-orgffa2701">
<ol class="org-ol">
<li>Napisanie struktury pracy (tutaj sections)</li>
<li>Podpięcie wyników symulacji</li>
<li>Zalanie tekstem</li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org074803c" class="outline-2">
<h2 id="org074803c">Plan pracy</h2>
<div class="outline-text-2" id="text-org074803c">
</div>
<div id="outline-container-orgb715885" class="outline-3">
<h3 id="orgb715885">Wprowadzenie</h3>
</div>
<div id="outline-container-org62c9ac5" class="outline-3">
<h3 id="org62c9ac5">Przedstawienie literatury i w szczególności tego artykułu</h3>
</div>
<div id="outline-container-orgc490522" class="outline-3">
<h3 id="orgc490522">Opis gry, populacji, dynamiki populacji, symulacji</h3>
</div>
<div id="outline-container-orgd6de973" class="outline-3">
<h3 id="orgd6de973">Przedstawienie wyników oraz dyskusja</h3>
<div class="outline-text-3" id="text-orgd6de973">
<p>
Tutaj porównanie do tego co jest w oryginalnym artykule.
</p>
</div>
</div>
<div id="outline-container-org5ad449b" class="outline-3">
<h3 id="org5ad449b">Zakończenie</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Data: 2022-04-06 Wed 00:00</p>
<p class="author">Autor: Michał Ramsza</p>
<p class="date">Created: 2022-04-06 Wed 14:02</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
